# running in data_writer/src/
plugin -i ghdl
# Analyze VHDL
ghdl --std=08 synchronizer_n.vhd data_writer.vhd -e data_writer
# Analyze SV - Must include the SV synchronizer now
read_verilog -sv -formal synchronizer_n_sv.sv
read_verilog -sv -formal data_writer_sv.sv
read_verilog -sv -formal data_writer_sva.sv
# Elaborate SV top
prep -top data_writer_sv
hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
